# __Topic: Pandas__

In [1]:
import re
import warnings
import numpy as np
import pandas as pd
warnings.filterwarnings('ignore')

### __25. Delete rows, columns, and indices from a DataFrame using appropriate Pandas methods.__

In [2]:
df = pd.DataFrame(np.random.randint(1,30, [6,5]), index=list("abcdef"), columns=list("ABCDF"))
df

    A   B   C   D   F
a  15  10  29  15   6
b   1  11   3   1  22
c  29   7  19   3   3
d   7  13  12   7   3
e  17  14  21  18  28
f   3  29  11   8  21

- __Deleting Rows:__

In [3]:
df.drop(["a","c"])

    A   B   C   D   F
b   1  11   3   1  22
d   7  13  12   7   3
e  17  14  21  18  28
f   3  29  11   8  21

- __Deleting Column:__

In [4]:
df.drop(["A", "C"], axis=1)

    B   D   F
a  10  15   6
b  11   1  22
c   7   3   3
d  13   7   3
e  14  18  28
f  29   8  21

- __Deleting Indices:__

In [5]:
df.reset_index(drop=True)

    A   B   C   D   F
0  15  10  29  15   6
1   1  11   3   1  22
2  29   7  19   3   3
3   7  13  12   7   3
4  17  14  21  18  28
5   3  29  11   8  21

### __26. Rename DataFrame columns and indices using Pandas methods.__

- __Renaming Columns:__

In [6]:
df.rename({"A": "Test-A", "C": "Test-C"}, axis=1, inplace=True)
df

   Test-A   B  Test-C   D   F
a      15  10      29  15   6
b       1  11       3   1  22
c      29   7      19   3   3
d       7  13      12   7   3
e      17  14      21  18  28
f       3  29      11   8  21

- __Renaming Indices:__

In [7]:
df.rename({"a": "test-a", "c": "test-c"}, axis=0)

        Test-A   B  Test-C   D   F
test-a      15  10      29  15   6
b            1  11       3   1  22
test-c      29   7      19   3   3
d            7  13      12   7   3
e           17  14      21  18  28
f            3  29      11   8  21

### __27. Find and replace specific characters in DataFrame column names.__

In [8]:
# Columns before changing specific character
df.columns

Index(['Test-A', 'B', 'Test-C', 'D', 'F'], dtype='object')

In [9]:
# Logic for changing Specific character
names = []
for x in df.columns:
    individual = ""
    for i in x:
        if i == "T":
            individual += "B"
        else:
            individual += i
    names.append(individual)
df.columns = names

In [10]:
# Specific character is replaced in Column names
df

   Best-A   B  Best-C   D   F
a      15  10      29  15   6
b       1  11       3   1  22
c      29   7      19   3   3
d       7  13      12   7   3
e      17  14      21  18  28
f       3  29      11   8  21

### __28. Filter DataFrame rows based on whether a column value is within a given list using isin().__

In [11]:
# given list
given_list = [1, 5, 6, 8, 10, 12]

# filtered rows
df[df['Best-A'].isin(given_list)]

   Best-A   B  Best-C  D   F
b       1  11       3  1  22

### __29. Apply a custom function to double the values in a specified DataFrame column using apply function.__

- __Applying the function to double the values of Colmun: _B_:__

In [12]:
df.B = df.B.apply(lambda x:x*2)
df

   Best-A   B  Best-C   D   F
a      15  20      29  15   6
b       1  22       3   1  22
c      29  14      19   3   3
d       7  26      12   7   3
e      17  28      21  18  28
f       3  58      11   8  21

### __30. Calculate the standard deviation and variance for all numeric columns in a DataFrame__

In [13]:
df.agg(['std', 'var'])

         Best-A           B     Best-C          D           F
std   10.488088   15.491933   9.086620   6.653320   11.089034
var  110.000000  240.000000  82.566667  44.266667  122.966667